# Duct Pressure Drop Data Class

Source: https://www.revitapidocs.com/2026/53565301-b25a-cd38-0c68-bed19d619c25.htm

---

| Duct Pressure Drop Data Class |
| --- |

The input and output data used by external servers for calculation of the duct pressure drop. Inheritance Hierarchy System Object
Autodesk.Revit.DB.Mechanical DuctPressureDropData

**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public class DuctPressureDropData : IDisposable
```

```
Public Class DuctPressureDropData
	Implements IDisposable
```

```
public ref class DuctPressureDropData : IDisposable
```

```
type DuctPressureDropData =
    class
        interface IDisposable
    end
```
The DuctPressureDropData type exposes the following members.

Properties

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId | The category id of duct curves. It will be OST\_DuctCurves, OST\_FlexDuctCurves, or OST\_PlaceHolderDucts. |
|  | Coefficient | The coefficient of the duct. |
|  | Density | The density of the duct. Units: (kg/ft³). |
|  | DynamicViscosity | The dynamic viscosity of the air in the duct. Units: (kg/(ft\*s)). |
|  | Flow | The flow of the duct. Units: (ft³/s). |
|  | Friction | The friction of the duct. Units: (kg/(ft²·s²)). |
|  | Height | The height of the duct. If the duct is round, it will be equal to the diameter of the duct. Units: (ft). |
|  | HydraulicDiameter | The hydraulic diameter of the duct. Units: (ft). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Length | The length of the duct. Units: (ft). |
|  | Level | The calculation level of the system. |
|  | PressureDrop | The pressure drop of the duct. Units: (kg/(ft·s²)). |
|  | ReynoldsNumber | The reynolds number of the duct. |
|  | Roughness | The roughness of the duct. Units: (ft). |
|  | Shape | The profile type of the duct. |
|  | Velocity | The velocity of the duct. Units: (ft/s). |
|  | VelocityPressure | The velocity pressure of the duct. Units: (kg/(ft·s²)). |
|  | WidthOrDiameter | The diameter of the duct with round profile, or the width of the duct with other profiles. Units: (ft). |

Top Methods

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DuctPressureDropData |
|  | Equals | Determines whether the specified object is equal to the current object. (Inherited from Object ) |
|  | GetHashCode | Serves as the default hash function. (Inherited from Object ) |
|  | GetType | Gets the Type of the current instance. (Inherited from Object ) |
|  | ToString | Returns a string that represents the current object. (Inherited from Object ) |

Top Remarks Profile type, Height, Diameter for round profile or width for other profiles, Length, Density, Viscosity, Roughness and Flow are input field values for the calculation. HydraulicDiameter, ReynoldsNumber, Velocity, VelocityPressure, Friction, PressureDrop, and Coefficient are output field values for the calculation See Also

#### Reference

Autodesk.Revit.DB.Mechanical Namespace